In [1]:
import pandas as p

In [2]:
advertisers = p.read_csv(r"C:\Elections-Ad-Spending-Analysis\elections-data\advertisers.csv")
locations = p.read_csv(r"C:\Elections-Ad-Spending-Analysis\elections-data\locations.csv")
results = p.read_csv(r"C:\Elections-Ad-Spending-Analysis\elections-data\locations.csv")

In [3]:
advertisers.head()

,Page ID,Page name,Disclaimer,Amount spent (INR),Number of ads in Library
0,121439954563203,Bharatiya Janata Party (BJP),Bharatiya Janata Party (BJP),193854342,43455
1,351616078284404,Indian National Congress,Indian National Congress,108787100,846
2,132715103269897,Ama Chinha Sankha Chinha,Ama Chinha Sankha Chinha,73361399,1799
3,192856493908290,Ama Chinha Sankha Chinha,Ama Chinha Sankha Chinha,32294327,680
4,109470364774303,Ellorum Nammudan,Populus Empowerment Network Private Limited,22399499,879

In [4]:
locations.head()

                 Location name  Amount spent (INR)
0  Andaman and Nicobar Islands              377858
1               Andhra Pradesh           100819732
2            Arunachal Pradesh             1385654
3                        Assam            17478091
4                        Bihar            53619242

In [5]:
results.head()

                 Location name  Amount spent (INR)
0  Andaman and Nicobar Islands              377858
1               Andhra Pradesh           100819732
2            Arunachal Pradesh             1385654
3                        Assam            17478091
4                        Bihar            53619242